import React from "react";
import styled from "styled-components";
const Body = styled.div`
  height: 100%;

  margin: 1em 2em;
  p {
    margin-left: 2em;
  }
`;

export default function TermsZh() {
  return (
    <Body>
      <h1>條款和條件</h1>

      <p> 2021-12-30 更新</p>

      <h1>一般條款</h1>

      <p>
        通過訪問 JokeHub 並下訂單，您確認您是 同意並受服務條款的約束
        條款和條件概述如下。這些條款適用於整個
        網站以及您和JokeHub之間的任何電子郵件或其他類型的通信。
        <br />
        <br />
        在任何情況下，JokeHub 團隊均不對任何直接的、
        間接的、特殊的、偶然的或後果性的損害，包括但
        不限於因使用而導致的數據或利潤損失，或 無法使用本網站上的材料，即使
        JokeHub 團隊或 授權代表已被告知這種可能性
        損害。如果您使用來自本網站的材料導致需要
        設備或數據的服務、修理或更正，您承擔任何 其費用。
        <br />
        <br />
        JokeHub 將不對期間可能發生的任何結果負責
        我們資源的使用過程。我們保留更改的權利 價格並隨時修改資源使用政策。
      </p>

      <h1>許可證</h1>

      <p>
        JokeHub 授予您可撤銷、非排他性、不可轉讓、
        下載、安裝和使用本網站的有限許可 根據本協議的條款。這些條款和條件 是您與
        JokeHub（“我們”、“我們的”或“我們”）之間的合同授予您
        可撤銷的、非排他性的、不可轉讓的、有限的許可
        嚴格按照本網站的下載、安裝和使用 本協議的條款。
      </p>

      <h1>定義和關鍵術語</h1>

      <p>對於本條款和條件:</p>

      <ul type="disc">
        <li>
          <strong> Cookie:</strong>
          由網站生成並由您的網站保存的少量數據
          瀏覽器。它用於識別您的瀏覽器、提供分析、
          記住有關您的信息，例如您的語言偏好或 登錄信息。
        </li>

        <li>
          <strong>公司:</strong>
          當本政策提及“公司”、“我們”、“我們”或“我們的”時，它指的是
          對根據本隱私對您的信息負責的 JokeHub 政策。
        </li>

        <li>
          <strong>國家:</strong>
          JokeHub 或 JokeHub 的所有者/創始人所在的地方，在這個 案例是台灣。
        </li>

        <li>
          <strong>客戶:</strong>
          指註冊使用該服務的公司、組織或個人 JokeHub 服務來管理與您的消費者或
          服務用戶。
        </li>

        <li>
          <strong>設備:</strong>
          任何連接互聯網的設備，例如手機、平板電腦、計算機或任何 可用於訪問
          JokeHub 和使用服務的其他設備。
        </li>

        <li>
          <strong> IP 地址:</strong>
          每個連接到 Internet 的設備都分配有一個編號，稱為 互聯網協議 (IP)
          地址。這些數字通常被分配 在地理塊中。IP 地址通常可用於識別 設備連接到
          Internet 的位置。
        </li>

        <li>
          <strong>人員:</strong>
          指受僱於 JokeHub 或在 代表一方當事人提供服務的合同。
        </li>

        <li>
          <strong>個人數據:</strong>
          任何直接、間接或與其他信息有關的信息 信息——包括個人識別號碼——允許
          自然人的身份或可識別性。
        </li>

        <li>
          <strong>服務:</strong>指 JokeHub 提供的服務，如相關內容所述
          條款（如果有）和在這個平台上。
        </li>

        <li>
          <strong>第三方服務:</strong>
          指廣告商、比賽贊助商、促銷和營銷 合作夥伴，以及提供我們內容或其產品或
          我們認為您可能感興趣的服務。
        </li>

        <li>
          <strong>網站:</strong>
          JokeHub 的站點，可以通過這個 URL 訪問:
          {"https://jokehub6969.web.app/ "}
        </li>

        <li>
          <strong>您:</strong>註冊的個人或實體 JokeHub 使用服務。
        </li>
      </ul>

      <h1>限制</h1>

      <p>您同意不這樣做，並且您不會允許其他人:</p>

      <ul type="disc">
        <li>
          許可、出售、出租、租賃、分配、分發、傳輸、託管、
          外包、披露或以其他方式商業利用服務或 使該平台可供任何第三方使用。
        </li>

        <li>
          修改、製作衍生作品、拆解、解密、反轉 編譯或反向工程服務的任何部分。
        </li>

        <li>
          刪除、更改或掩蓋任何所有權通知（包括任何通知
          版權或商標）或其附屬公司、合作夥伴、供應商 或服務的許可方。
        </li>
      </ul>

      <h1>用戶生成的內容</h1>

      <p>通過向我們的網站提交您的笑話，您在此聲明並保證:</p>

      <ul>
        <li>您擁有包括智慧財產權在內的所有權利 您的用戶內容，</li>

        <li>您已獲得出現在您的用戶內容中的人的許可授予此處的權利。</li>
      </ul>

      <p>因此，JokeHub 不對用戶可能造成的任何類型的違規行為負責。</p>

      <h1>您的建議</h1>

      <p>
        您向我們提供的有關服務的任何反饋、評論、想法、改進或建議（統稱為“建議”）均屬於我們的專有財產。我們可以出於任何目的和以任何方式自由使用、複製、修改、發布或重新分發這些建議，而無需向您提供任何信用或任何補償。
      </p>

      <h1>您的同意</h1>

      <p>
        我們更新了我們的條款和條件，為您提供完整的
        當您訪問我們的網站時設置什麼以及它是如何設置的透明化
        正在使用。通過使用我們的服務、註冊帳戶、製作或
        購買，即代表您此同意我們的條款和條件。
      </p>

      <h1>其他網站的鏈接</h1>

      <p>
        我們的服務可能包含指向並非由我們運營的其他網站的鏈接。如果您單擊第三方鏈接，您將被定向到該第三方的站點。我們強烈建議您查看您訪問的每個網站的條款和條件。我們無法控制任何第三方網站或服務的內容、條款和條件或做法，也不對其承擔任何責任。
      </p>

      <h1>Cookies</h1>

      <p>
        我們使用“Cookies”來識別您訪問過的我們網站的區域。 Cookie
        是您的網絡瀏覽器存儲在您的計算機或移動設備上的一小段數據。 我們使用
        Cookies 來增強我們服務的性能和功能，但對它們的使用不是必需的。
        但是，如果沒有這些
        cookie，視頻等某些功能可能無法使用，或者您每次訪問我們的平台時都需要輸入登錄詳細信息
        ，因為我們將無法記住您之前是否登錄過。大多數網絡瀏覽器都可以設置為禁止使用
        Cookie。但是，如果您禁用
        Cookie，您可能無法正確或根本無法訪問我們網站上的功能。但我們不會把個人資料放在
        Cookie 中。
      </p>

      <h1>我們的條款和條件的變更</h1>

      <p>
        您承認並同意，我們通常可以自行決定停止（永久或暫時）向您或用戶提供服務（或服務中的任何功能），
        恕不另行通知。您可以隨時停止使用服務。當您停止使用服務時，您無需特別通知我們。您承認並同意，
        如果我們禁止訪問您的帳戶，您可能無法訪問服務、您的帳戶詳細信息或您帳戶中包含的任何文件或其他材料。
        如果我們決定更改我們的條款和條件，我們將在此頁面上發布這些更改，和/或更新下面的條款和條件修改日期。
      </p>

      <h1>我們服務的修改</h1>

      <p>
        我們保留在通知或不通知的情況下臨時或永久修改、暫停或中斷服務或它所連接的任何服務的權利，並且不對您承擔任何責任。
      </p>

      <h1>我們服務的更新</h1>

      <p>
        我們可能會不時提供對服務特性/功能的增強或改進，其中可能包括補丁、錯誤修復、更新、升級和其他修改（“更新”）。
        更新可能會修改或刪除服務的某些特性和/或功能。您同意我們沒有義務 (i)
        提供任何更新，或 (ii)
        繼續向您提供或啟用服務的任何特定特性和/或功能。您進一步同意，所有更新將
        (i) 視為構成服務的組成部分，並且 (ii) 受本協議的條款和條件的約束。
      </p>

      <h1>第三方服務</h1>

      <p>
        我們可能會顯示、包含或提供第三方內容（包括數據、信息、應用程序和其他產品服務）或提供第三方網站或服務（“第三方服務”）的鏈接。
        您承認並同意，我們不對任何第三方服務負責，包括其準確性、完整性、及時性、有效性、版權合規性、合法性、體面、質量或其任何其他方面。
        對於任何第三方服務，我們不承擔也不應對您或任何其他個人或實體承擔任何責任或義務。第三方服務及其鏈接僅為您提供便利而提供，
        您訪問和使用它們的風險完全由您自己承擔，並受此類第三方的條款和條件的約束。
      </p>

      <h1>期限和終止</h1>

      <p>
        本協議在您或我們終止之前一直有效。我們可以隨時自行決定以任何理由或無理由暫停或終止本協議，無論是否事先通知。
        如果您未能遵守本協議的任何規定，本協議將立即終止，恕不另行通知。您也可以通過從您的計算機中刪除服務及其所有副本來終止本協議。
        本協議終止後，您應停止使用該服務並從您的計算機中刪除該服務的所有副本。
        如果您（在本協議期限內）違反本協議項下的任何義務，本協議的終止不會限制我們在法律或衡平法上的任何權利或補救措施。
      </p>

      <h1>版權侵權通知</h1>

      <p>
        版權侵權通知
        如果您是版權所有者或此類所有者的代理人，並且認為我們提供的任何材料構成對您版權的侵犯，請聯繫我們並提供以下信息:(a)
        版權所有者或被授權採取行動的人的物理或電子簽名以他的名義; (b)
        確定聲稱侵權的材料； (c)
        您的聯繫信息，包括您的地址、電話號碼和電子郵件； (d)
        您的聲明，表明您真誠地相信該材料的使用是經版權所有人授權； (e)
        聲明通知中的信息準確無誤，並且在作偽證的情況下，您有權代表所有者行事。
      </p>

      <h1>賠償</h1>

      <p>
        您同意對我們和我們的母公司、子公司、
        附屬公司、管理人員、員工、代理人、合作夥伴和許可方（如果有）
        不受任何索賠或要求的傷害，包括合理的律師費， 由於或由您引起:(a)
        使用服務；(b) 違反 本協議或任何法律或法規；(c) 侵犯任何權利 第三方的。
      </p>

      <h1>無保證</h1>

      <p>
        該服務“按原樣”和“可用”提供給您，所有故障和缺陷均不提供任何形式的保證。
        在適用法律允許的最大範圍內，我們代表我們自己和我們的關聯公司以及我們各自的許可方和服務提供商，
        明確拒絕對服務做出所有保證，無論是明示的、暗示的、法定的或其他方式的，包括對適銷性、特定用途的適用性、
        所有權和不侵權的所有默示保證，以及可能因交易過程、性能過程、使用或貿易慣例而產生的保證。在不限於上述規定的情況下，
        我們不提供任何保證或承諾，也不以任何形式表示服務將滿足您的要求、實現任何預期結果、兼容或與任何其他軟件、網站、系統或服務兼容，
        在沒有中斷、滿足任何性能或可靠性標准或無錯誤或任何錯誤或缺陷可以或將被糾正。
        <br />
        <br />
        在不限制前述規定的情況下，我們或任何供應商均不作出任何明示或暗示的陳述或保證:
        (i) 關於服務的操作或可用性，或其中包含的信息、內容和材料或產品； (ii)
        服務不會中斷或沒有錯誤； (iii)
        關於通過服務提供的任何信息或內容的準確性、可靠性或流通性； (iv)
        由我們或代表我們發送的服務、
        其服務器、內容或電子郵件沒有病毒、腳本、特洛伊木馬、蠕蟲、惡意軟件、定時炸彈或其他有害組件。某些司法管轄區
        不允許排除或限制默示保證或限制消費者適用的法定權利，因此上述部分或全部排除和限制可能不適用於您。
      </p>

      <h1>責任限制</h1>

      <p>
        責任限制 儘管您可能遭受任何損害，
        我們和我們的任何供應商根據本協議的任何規定承擔的全部責任以及您對上述所有事項的唯一補救措施應限於您為服務實際支付的金額。
        在適用法律允許的最大範圍內，在任何情況下，我們或我們的供應商均不對任何特殊的、偶然的、間接的或後果性的損害
        （包括但不限於利潤損失、數據丟失或其他信息，用於業務中斷、人身傷害、因使用或無法使用服務、
        第三方軟件和/或與服務一起使用的第三方硬件而引起或以任何方式相關的隱私丟失，或以其他方式與本協議的任何條款相關），
        即使我們或任何供應商已被告知此類損害的可能性，即使補救措施未能達到其基本目的。某些州/司法轄區不允許排除或限制偶然或間接損害
        ，因此上述限製或排除可能不適用於您。
      </p>

      <h1> 可分割性</h1>

      <p>
        如果本協議的任何條款被認定為不可執行或無效，則該條款將被更改和解釋以在適用法律的最大範圍內實現該條款的目標，其餘條款將繼續完全有效。
        <br />
        <br />
        本協議連同隱私政策和我們在服務上發布的任何其他法律聲明，構成您與我們之間關於服務的完整協議。
        如果本協議的任何條款被有管轄權的法院認定為無效，則該條款的無效不影響本協議其餘條款的有效性，該條款將繼續完全有效。
        對本協議任何條款的放棄不應被視為對該條款或任何其他條款的進一步或持續放棄，
        我們未能主張本協議項下的任何權利或規定不構成對此類權利或規定的放棄。
        您和我們同意，由服務引起或與之相關的任何訴訟事由必須在訴訟事由發生後乙年內開始。否則，此類訴訟因由永久禁止。
      </p>

      <h1>豁免</h1>

      <p>
        除本協議另有規定外，未能行使權利或要求 履行本協議項下的義務不應影響
        一方行使此類權利或要求此類履行的能力 此後的任何時間也不構成對違約的棄權
        放棄任何隨後的違規行為。
        <br />
        <br />
        沒有不鍛煉，也沒有延遲鍛煉，
        任何一方，本協議項下的任何權利或任何權力不得經營
        作為對該權利或權力的放棄。也不得任何單一或部分
        行使本協議項下的任何權利或權力，進一步排除
        行使該人或本協議授予的任何其他權利。在的情況下，
        本協議及任何適用購買或其它衝突 條款，以本協議的條款為準。
      </p>

      <h1>本協議的修訂</h1>

      <p>
        我們保留權利，自行決定，修改或替換本 隨時同意。如果修訂很重要，我們將在
        在任何新條款生效前至少提前 30 天通知。什麼
        構成重大變化將由我們自行決定。 通過在任何修訂後繼續訪問或使用我們的服務
        有效的，您同意遵守修改後的條款的約束。如果你不
        同意新條款，您不再被授權使用我們的服務。
      </p>

      <h1>完整協議</h1>

      <p>
        本協議構成您與我們之間的完整協議 關於您對服務的使用，並取代所有先前和
        您與我們之間的同期書面或口頭協議。您可以
        受您使用或使用時適用的附加條款和條件的約束
        從我們這裡購買其他服務，我們將在 此類使用或購買的時間。
      </p>

      <h1>我們條款的更新</h1>

      <p>
        我們可能會改變我們的服務和政策，我們可能需要做出改變
        這些條款，以便它們準確反映我們的服務和政策。
        除非法律另有要求，否則我們會通知您（例如，
        通過我們的服務）在我們更改這些條款並為您提供
        有機會在它們生效之前對其進行審查。那麼，如果你
        繼續使用服務，您將受更新條款的約束。如果
        您不想同意這些或任何更新的條款，您可以刪除 您的帳戶。
      </p>

      <h1>知識產權</h1>

      <p>
        我們的平台及其全部內容、特性和功能
        （包括但不限於所有信息、軟件、文本、顯示、圖像、視頻和音頻及其設計、選擇和安排），除了用戶生成的內容外
        均歸我們、其許可方或其他方所有此類材料的提供者，並受台灣和國際版權、商標、專利、商業秘密和其他知識產權或專有權法律的保護。未經我們事先明確書面許可，不得以任何方式全部或部分複制、修改、複製、下載或分發材料，除非這些條款和條件中有明確規定。禁止未經授權使用該材料。
      </p>

      <h1>仲裁協議</h1>

      <p>
        本節適用於任何爭議，但不包括爭議 關於禁令或公平救濟的索賠
        您或您的知識產權的執行或有效性。這
        術語“爭議”是指雙方之間的任何爭議、行動或其他爭議
        您和我們有關的服務或本協議，無論是在
        合同、保證、侵權、法令、法規、條例或任何其他
        法律或公平的基礎。“爭議”將得到盡可能廣泛的解決 法律允許的意思。
      </p>

      <h1>爭議通知</h1>

      <p>
        如果發生爭議，您或我們必須向對方發出通知
        爭議，這是一份書面聲明，列出姓名、地址、 和提供方的聯繫方式，導致的事實
        爭議，以及請求的救濟。您必鬚髮送任何通知
        爭議通過電子郵件發送至:。我們將通過以下方式向您發送任何爭議通知
        郵寄到您的地址（如果我們有），或郵寄到您的電子郵件地址。
        您和我們將嘗試通過非正式的方式解決任何爭議 自爭議通知之日起六十 (60)
        天內協商 已發送。六十 (60) 天后，您或我們可以開始仲裁。
      </p>

      <h1> 有約束力的仲裁</h1>

      <p>
        如果您和我們不通過非正式談判解決任​​何爭議，任何 解決爭議的其他努力將由
        本節所述的具有約束力的仲裁。你正在放棄
        有權提起訴訟（或作為黨員或班級成員參與）所有
        在法官或陪審團面前的法庭糾紛。爭議將得到解決
        根據商事仲裁通過具有約束力的仲裁
        美國仲裁協會的規則。任何一方都可以尋求任何
        來自任何有管轄權的法院的臨時或初步禁令救濟
        為保護當事人的權利或財產所必需的管轄權
        等待仲裁完成。任何和所有法律、會計、
        以及勝訴方產生的其他成本、費用和開支 由非勝訴方承擔。
      </p>

      <h1>提交和隱私</h1>

      <p>
        如果您提交或發布任何想法、創意建議，
        設計、照片、信息、廣告、數據或提案，
        包括對新的或改進的產品、服務、功能的想法，
        技術或促銷活動，您明確同意此類提交 將自動被視為非機密和非專有
        並將成為我們的唯一財產，無需任何補償或
        信用卡給你任何責任。我們和我們的附屬機構不得有
        與此類提交或帖子有關的義務，並且可以使用
        出於任何目的在此類提交或帖子中包含的想法 永久中等，包括但不限於發展，
        使用這些想法製造和營銷產品和服務。
      </p>

      <h1>促銷活動</h1>

      <p>
        我們可能會不時舉辦競賽、促銷、抽獎活動或
        其他需要您提交材料或的活動（“促銷活動”）
        關於你自己的信息。請注意，所有促銷活動可能
        受可能包含某些資格的單獨規則管轄 要求，例如年齡和地理位置的限制。
        您有責任閱讀所有促銷規則以確定是否
        不是你有資格參加。如果您輸入任何促銷信息，您
        同意遵守並遵守所有促銷規則。額外的 條款和條件可能適用於在或
        通過服務，哪些條款和條件成為本服務的一部分 經此引用同意。
      </p>

      <h1>印刷錯誤</h1>

      <p>
        如果產品和/或服務的價格不正確或 由於印刷錯誤，信息不正確，我們將
        拒絕或取消為產品和/或 以不正確的價格列出的服務。我們有權拒絕
        或取消任何此類訂單，無論訂單是否已確認，並且
        你的信用卡收費。如果您的信用卡已經被扣款
        對於購買和您的訂單被取消，我們將立即發出
        貸記到您的信用卡帳戶或其他付款帳戶 收費金額。
      </p>

      <h1>其他</h1>

      <p>
        如果出於任何原因，有管轄權的法院發現任何規定
        或這些條款和條件的一部分不可執行，
        這些條款和條件的其餘部分將繼續完全有效，並且
        影響。對這些條款和條件的任何規定的任何放棄將
        只有以書面形式並由授權人簽字才有效 我們的代表。我們將有權獲得禁令或其他
        衡平法救濟（沒有提供任何保證金或擔保的義務）
        如果您有任何違約或預期違約。我們經營和
        從我們在台灣的辦事處控制我們的服務。服務不是
        旨在分發給任何人或實體或由任何人或實體使用
        此類分發或使用將相反的司法管轄區或國家
        到法律或法規。因此，那些選擇訪問的人
        我們來自其他地方的服務是主動這樣做的，並且
        全權負責遵守當地法律，如果和在一定程度上
        適用當地法律。這些條款和條件（包括和
        納入我們的隱私政策）包含完整的理解，以及
        取代您和我們之間關於其的所有先前諒解 主題，並且您不能更改或修改。這部分
        本協議中使用的標題僅為方便起見，不會 給予任何合法進口。
      </p>

      <h1>免責聲明</h1>

      <p>
        我們不對任何內容、代碼或任何其他不精確負責。
        我們不提供擔保或保證。在任何情況下，我們都不會
        對任何特殊的、直接的、間接的、後果性的或附帶的
        損害或任何損害，無論是在合同訴訟中，
        因使用而引起或與之相關的疏忽或其他侵權行為
        服務或服務的內容。我們保留權利 對本網站上的內容進行添加、刪除或修改
        隨時服務，恕不另行通知。
        <br />
        <br />
        我們的服務及其內容按“原樣”和“可用”提供
        沒有任何形式的保證或陳述，無論是明示的還是
        默示。我們是分銷商，而不是內容的出版商
        由第三方提供；因此，我們不行使編輯控制權 對此類內容不作任何保證或陳述
        任何信息、內容、服務的準確性、可靠性或流通性
        或通過我們的服務提供或訪問的商品。沒有
        限制上述內容，我們明確否認所有保證和
        在我們傳輸的或與之相關的任何內容中的陳述
        服務或在我們的服務或網站中可能顯示為鏈接的網站
        作為我們的一部分或以其他方式提供的產品
        服務，包括但不限於任何適銷性保證， 適用於特定目的或不侵犯第三方
        權利。我們或其任何人沒有提供口頭建議或書面信息
        附屬公司、僱員、高級職員、董事、代理人或類似人員將
        創建保修。價格和可用性信息受制於
        更改恕不另行通知。在不限制上述內容的情況下，我們不保證
        我們的服務將不會中斷、不損壞、及時，或 無差錯。
      </p>

      <h1>聯繫我們</h1>

      <p>如果您有任何問題，請隨時與我們聯繫。</p>

      <p>通過電子郵件:samkondori@gmail.com </p>

      <br />
      <br />
    </Body>
  );
}
